Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་བསྙེན་མ་བཟང་མོའི་མཆོག་གི་དྲུང་ནས་སོང་ངོ་། །
en: He circumambulated the kalyāṇamitra Bhadrottamā many hundreds of thousands of times, keeping her to his right, and, looking back at her again and again, he departed from the kalyāṇamitra Bhadrottamā.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་དུ་སོང་སྟེ། གྲོང་ཁྱེར་རྒྱས་པའི་འགྲམ་དུ་གསེར་འཚོང་གཅེས་པ་གཏོང་བ་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Muktāsāra Chapter 49 Sudhana, the head merchant’s son, eventually arrived in the southern region, and in the town of Bharukaccha he approached the goldsmith Muktāsāra.

source: གསེར་འཚོང་གཅེས་པ་གཏོང་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He bowed his head to the feet of the goldsmith Muktāsāra and then, standing before him with his palms together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ། དེས་སྨྲས་པ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དྲན་པ་ཐོགས་པ་མྱེད་པ་ལ་རྣམ་པར་དག་པས་རྣམ་པར་བརྒྱན་པ་ཞེས་བྱ་བ་ཤེས་ཏེ།
en: When he had said that, the goldsmith Muktāsāra said, “Noble one, I know the bodhisattva liberation called the display of pureunimpeded memory.

source: ཁོ་བོས་ནི་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་ཆོས་ཡོངས་སུ་ཚོལ་བ་རྒྱུན་མི་གཅོད་པའོ། །
en: I continuously seek the Dharma at the feet of the tathāgatas in the ten directions.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་དྲན་པ་ཐོགས་པ་མེད་པ་ལ་རྣམ་པར་དག་པས་རྣམ་པར་བརྒྱན་པ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the display of pureunimpeded memory.

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་བག་ཚ་བ་མྱེད་པར་སེང་གེའི་ང་རོ་སྒྲོག་པ་བསོད་ནམས་དང་ཡེ་ཤེས་ཆེན་པོ་ལ་གནས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །
en: How could I know the conduct or describe the qualities of the bodhisattvas who have the fearless lion’s roar and are established in great merit and wisdom?

source: སོང་རིགས་ཀྱི་བུ་རྒྱས་པའི་འགྲམ་གྱི་གྲོང་ཁྱེར་འདི་ཉིད་ན་ཁྱིམ་བདག་ཟླ་བ་བཟང་པོ་ཞེས་བྱ་བ་རྟག་ཏུ་ཁྱིམ་སྣང་བར་གྱུར་པ་དང་ལྡན་པ་ཞིག་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ།
en: “Depart, noble one. In the forest beside this town of Bharukaccha resides a householder by the name of Sucandra who has a continuously shining house.

source: སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །
en: Go to him and ask him, ‘How should a bodhisattva train in and practice bodhisattva conduct?’ ”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་གསེར་འཚོང་གཅེས་པ་གཏོང་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the goldsmith Muktāsāra.

source: གསེར་འཚོང་གཅེས་པ་གཏོང་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། གསེར་འཚོང་གཅེས་པ་གཏོང་བའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཁྱིམ་བདག་ཟླ་བ་བཟང་པོ་གང་ན་བ་དེར་སོང་སྟེ།
en: He circumambulated the goldsmith Muktāsāra many hundreds of thousands of times, keeping him to his right, and, looking back at him again and again, he departed from the goldsmith Muktāsāra.

source: ཁྱིམ་བདག་ཟླ་བ་བཟང་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: Sucandra Chapter 50 Sudhana went to the householder Sucandra, bowed his head to the feet of the householder Sucandra, stood before him, and, with his palms together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བསྟན་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: སྨྲས་པ་རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བ་ཐོབ་སྟེ།
en: When he had said that, the householder Sucandra said, “Noble one, I know the bodhisattva liberation called the stainless light of wisdom.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་དྲི་མ་མྱེད་པའི་འོད་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the stainless light of wisdom.

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཚད་མེད་པ་ཐོབ་པ་རྣམས་ཀྱི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །
en: How could I know the conduct or describe the qualities of the bodhisattvas who have attained countless liberations?

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་རི་དགས་གནས་ཤེས་བྱ་བ་ཡོད་དེ།
en: “Depart, noble one. In this southern region there is a town called Roruka.

source: དེ་ན་ཁྱིམ་བདག་མྱི་ཕམ་སྡེ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་།
en: There resides a householder by the name of Ajitasena.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཁྱིམ་བདག་ཟླ་བ་བཟང་པོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the householder Sucandra.

source: ཁྱིམ་བདག་ཟླ་བ་བཟང་པོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཁྱིམ་བདག་ཟླ་བ་བཟང་པོའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་གྲོང་ཁྱེར་རི་དགས་ཀྱི་གནས་གང་ན་བ་དེར་སོང་སྟེ།
en: He circumambulated the householder Sucandra many hundreds of thousands of times, keeping him to his right, and, looking back at him again and again, he departed from the householder Sucandra.

source: ཁྱིམ་བདག་མི་ཕམ་སྡེ་གང་ན་བ་དེར་ཕྱིན་ནས། ཁྱིམ་བདག་མི་ཕམ་སྡེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: Ajitasena Chapter 51 Sudhana eventually reached the town of Roruka and approached the householder Ajitasena, bowed his head to the feet of the householder Ajitasena, stood before him, and, with his palms together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ། སྨྲས་པ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: རིགས་ཀྱི་བུ་ཁོ་བོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་མྱི་ཟད་པའི་མཚན་ཉིད་ཅེས་བྱ་བ་ཐོབ་སྟེ་དེ་ཐོབ་པས་ནི། སངས་རྒྱས་མི་ཟད་པ་མཐོང་བའི་གཏེར་རབ་ཏུ་ཐོབ་པར་འགྱུར་ཏོ། །
en: When he had said that, the householder Ajitasena said, “Noble one, I have attained the bodhisattva liberation called unceasing characteristics so that I have attained the treasure of the unceasing vision of the buddhas.

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་ཆོས་ཀྱི་ཡུལ་གྲུ་ན་བྲམ་ཟེ་ཞི་འཛིན་མཆོག་ཅེས་བྱ་བ་ཞིག་འདུག་གིས།
en: “Depart, noble one. In this southern region, in the village called Dharma, resides a brahmin by the name of Śivarāgra.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཁྱིམ་བདག་མྱི་ཕམ་སྡེའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the householder Ajitasena.

source: ཁྱིམ་བདག་མི་ཕམ་སྡེ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ།
en: He circumambulated the householder Ajitasena many hundreds of thousands of times, keeping him to his right, and, looking back at him again and again, he departed from the householder Ajitasena.

source: ཁྱིམ་བདག་མི་ཕམ་སྡེའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་ཆོས་ཀྱི་ཡུལ་གྲུར་སོང་ནས། བྲམ་ཟེ་ཞི་འཛིན་མཆོག་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Śivarāgra Chapter 52 Sudhana eventually reached the village of Dharma and approached the brahmin Śivarāgra.

source: བྲམ་ཟེ་ཞི་འཛིན་མཆོག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He bowed his head to the feet of the brahmin Śivarāgra, stood before him, and, with his palms together in homage, said, “Ārya, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་པས་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ། །
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེས་སྨྲས་པ། རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བདེན་པའི་བྱིན་གྱི་རླབས་ཀྱིས་སྤྱོད་པ་སྟེ།
en: When he had said that, the brahmin Śivarāgra said, “Noble one, I have the conduct empowered by truth.

source: བདེན་པའི་ཚིག་གང་གིས་དུས་གསུམ་དུ་བྱང་ཆུབ་སེམས་དཔའ་གང་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་ལྡོག་པར་མི་འགྱུར་ཞེ་ན།
en: There is the speech of truth by which the bodhisattvas in the three times have not turned back, do not turn back, and will never turn back from the highest, complete enlightenment.

source: བདེན་པའི་ཚིག་གི་བྱིན་གྱི་རླབས་དེས། བདག་གི་དགོས་པ་འདི་དང་འདི་ཞིག་གྲུབ་པར་ཤོག་ཤིག་ཅེས་བྱས་ན་ཡང་དེས་ཁོ་བོའི་བསམ་པ་ཐམས་ཅད་དེ་བཞིན་དུ་འགྲུབ་བོ། །
en: Through the empowerment of that speech of truth, if I say ‘May this and that necessity be accomplished!’

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བདེན་པའི་བྱིན་གྱི་རླབས་དེ་ལྟ་བུས་དགོས་པ་ཐམས་ཅད་སྒྲུབ་སྟེ།
en: then all my wishes become fulfilled.

source: རིགས་ཀྱི་བུ་ཁོ་བོས་བདེན་པའི་བྱིན་གྱིས་རླབས་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this empowerment of the truth.

source: ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་བདེན་པའི་རྗེས་སུ་འབྲང་བའི་ཚིག་རབ་ཏུ་ཐོབ་པ་རྣམས་ཀྱི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །
en: How could I know the conduct or describe the qualities of the bodhisattvas who have attained the speech devoted to truth?

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་ཡིད་བཟང་པོའི་སྒོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: “Depart, noble one. In this southern region there is a town called Sumanāmukha.

source: དེ་ན་ཁྱེའུ་དཔལ་འབྱུང་བ་ཞེས་བྱ་བ་དང་། བུ་མོ་དཔལ་གྱི་བློ་གྲོས་མ་ཞེས་བྱ་བ་གཉིས་ཤིག་འཁོད་ཀྱིས་དེའི་གན་དུ་སོང་ལ།
en: There resides a boy by the name of Śrīsaṃbhava and a girl by the name of Śrīmati.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱི་ཆོས་ཀྱི་རིམ་གྲོ་ཆེར་བསྐྱེད་དེ། བྲམ་ཟེ་ཞི་འཛིན་མཆོག་གི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the brahmin Śivarāgra.

source: བྲམ་ཟེ་ཞི་འཛིན་མཆོག་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས། བྲམ་ཟེ་ཞི་འཛིན་མཆོག་གི་དྲུང་ནས་སོང་ངོ་།
en: He circumambulated the brahmin Śivarāgra many hundreds of thousands of times, keeping him to his right, and, looking back at him again and again, he departed from the brahmin Śivarāgra.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་གྲོང་ཁྱེར་ཡིད་བཟང་པོའི་སྒོར་སོང་སྟེ། ཁྱེའུ་དཔལ་འབྱུང་བ་དང་། བུ་མོ་དཔལ་གྱི་བློ་གྲོས་མ་གང་ན་བ་དེར་ཕྱིན་ནས་དེ་གཉིས་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Śrīsaṃbhava and Śrīmati Chapter 53 Sudhana eventually reached the town of Sumanāmukha and approached the boy Śrīsaṃbhava and the girl Śrīmati.

source: མདུན་དུ་འདུག་ནས་ཐལ་མོ་སྦྱར་ཏེ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་ཏུ་བགྱི་བ་མ་འཚལ་ཏེ།
en: He bowed his head to their feet, stood before them with his palms together in homage, and said, “Āryas, I have developed the aspiration for the highest, complete enlightenment, but I do not know how bodhisattvas should train in bodhisattva conduct and in what way they should practice it.

source: འཕགས་པ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་རྗེས་སུ་བསྟན་པ་མཛད་དོ། །ཞེས་བདག་གིས་ཐོས་ན།
en: Āryas, I have heard that you give instruction and teachings to bodhisattvas!

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་འཕགས་པ་དག་གིས་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: དེ་ནས་ཁྱེའུ་དཔལ་འབྱུང་བ་དང་། བུ་མོ་དཔལ་གྱི་བློ་གྲོས་མས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་བདག་ཅག་གཉིས་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྒྱུ་མའི་རྣམ་པ་ཞེས་བྱ་བ་ཐོབ་སྟེ།
en: The boy Śrīsaṃbhava and the girl Śrīmati said to Sudhana, the head merchant’s son, “Noble one, we have both attained and manifested the bodhisattva liberation called the appearance of illusion.

source: མངོན་དུ་བྱས་སོ་རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ཅག་རྣམ་པར་ཐར་པ་འདི་དང་ལྡན་པས། འཇིག་རྟེན་ཐམས་ཅད་སྒྱུ་མའི་རྣམ་པར་རྒྱུ་རྐྱེན་སྒྱུ་མ་ལས་བྱུང་བར་མཐོང་ངོ་། །
en: “Noble one, through possessing this liberation, we see all worlds as the appearance of illusions arising from illusory causes and conditions.

source: ལས་དང་ཉོན་མོངས་པ་སྒྱུ་མར་ཤེས་པས། སེམས་ཅན་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་ཤེས་སོ། །
en: “We know karma and kleśas to be illusions, and so we know all beings to be the appearance of illusions.

source: མ་རིག་པ་དང་། སྲིད་པ་དང་། སྲེད་པའི་རྒྱུ་ལས་བྱུང་བས་འགྲོ་བ་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་། །
en: “We see that all beings are the appearance of illusions because they arise from illusory ignorance, becoming, and craving.

source: ཕན་ཚུན་གྱི་རྐྱེན་གྱི་རྒྱུ་ལས་བྱུང་བས་ཆོས་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་། །
en: “We see that all phenomena are the appearance of illusions because they arise from illusory interdependent conditions.

source: ཕྱིན་ཅི་ལོག་གི་སྒྱུ་མ་ལས་བྱུང་བས་ཁམས་གསུམ་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་། །
en: “We see that all three realms also are the appearance of illusions because they arise from erroneous illusions.

source: ཡང་དག་པ་མ་ཡིན་པའི་རྟོག་པའི་རྒྱུས་བསྐྱེད་པས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཤི་འཕོ་དང་། འབྱུང་བ་དང་། སྐྱེ་བ་དང་། རྒ་ཤི་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་།
en: “We see the passing away and transference, conception, birth, old age and death, misery, wailing, suffering, unhappiness, and agitation of all beings as the appearance of illusions because they arise from the illusion of incorrect thoughts.

source: སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་། །འདུ་ཤེས་དང་སེམས་དང་ལྟ་བ་ཕྱིན་ཅི་ལོག་གི་རྒྱུ་ལས་དངོས་པོ་མྱེད་པའི་འདུ་ཤེས་ཀྱིས་རྨོངས་ཏེ། བྱུང་བས་ཞིང་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་། །
en: “We see all realms also as illusions because they arise from being bewildered by conceptions of nonexistence because of the illusions of erroneous conceptions, motivations, and views.

source: ཡེ་ཤེས་ཀྱིས་སྤོང་བའི་རྒྱུ་ལས་བརྟག་སྟེ། །བསྐྱེད་པས་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱང་སྒྱུ་མའི་རྣམ་པར་མཐོང་ངོ་། །སྒྱུ་མར་མངོན་པར་བསྒྲུབ་པ་ལས་གྲུབ་སྟེ།
en: “We see all śrāvakas and pratyeka­buddhas as the appearance of illusion because they arise from illusory analysis that has discarded wisdom.

source: སྤྲུལ་པའི་སྤྱོད་པ་དང་། འདུལ་བའི་སྒྱུ་མའི་རང་བཞིན་པས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱིས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། འདུལ་བ་གཅིག་ནས་གཅིག་ཏུ་བརྒྱུད་པ་ཡང་སྒྱུ་མའི་རྣམ་པ་ལྟ་བུར་ཤེས་སོ། །
en: “We also know the successive ripening and guiding of beings through bodhisattva conduct and prayers to be like the appearance of illusions because they are accomplished as illusions having emanated conduct and guidance that have the nature of being illusions.

source: སྨོན་ལམ་དང་ཡེ་ཤེས་སྒྱུ་མས་མངོན་པར་བསྒྲུབས་ཏེ། ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་སྒྱུ་མའི་རང་བཞིན་ཡིན་པས་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དཀྱིལ་འཁོར་ཡང་སྒྱུ་མར་མཐོང་ངོ་། །
en: “We see the field of buddhas and bodhisattvas as the appearance of illusions, because it is accomplished through the illusion of prayers and wisdom and has the nature of being an illusory inconceivable range of perception.

source: རིགས་ཀྱི་བུ་བདག་ཅག་གཉིས་ཀྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སྒྱུ་མའི་རང་བཞིན་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, the two of us know only this bodhisattva liberation called the appearance of illusion.

source: ཁོ་བོ་ཅག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ལས་སྒྱུ་མ་མཐའ་ཡས་པས་རྣམ་པར་བསྒྲུབས་པའི་དྲ་བ་ཁོང་དུ་ཆུད་པ་རྣམས་ཀྱི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: How could we know the conduct or describe the qualities of the bodhisattvas who have realized the net of the accomplishment of infinite illusory activities?”

source: དེ་ནས་ཁྱེའུ་དཔལ་འབྱུང་བ་དང་། བུ་མོ་དཔལ་གྱི་བློ་གྲོས་མས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་དགེ་བའི་རྩ་བའི་ཤུགས་དྲག་པོ་བསམ་གྱིས་མི་ཁྱབ་པས་མངོན་པར་བརླན་ནས་རང་གི་རྣམ་པར་ཐར་པའི་ཡུལ་བསྟན་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Then the boy Śrīsaṃbhava and the girl Śrīmati, through having saturated Sudhana, the head merchant’s son, with inconceivable, powerful roots of merit, and having taught him their own liberation, said, “Depart, noble one.

source: སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ཀྱི་ཕྱོགས་ཀྱི་སྒོའི་གནས་རྒྱ་མཚོའི་འགྲམ་ཞེས་བྱ་བ་དེ་ན་བཟའ་ཤིང་གི་ར་བ་རྒྱན་ཆེན་པོ་ཞེས་བྱ་བ་ཡོད་དེ།
en: In this southern region there is a great park called Mahāvyūha in a province called Samudrakaccha.

source: དེའི་ནང་ན་ཁང་པ་བརྩེགས་པ་ཆེན་པོ་རྣམ་པར་སྣང་མཛད་ཀྱི་རྒྱན་གྱིས་བརྒྱན་པའི་སྙིང་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་དགེ་བའི་རྩ་བ་རྣམ་པར་སྨིན་པ་ལས་མངོན་པར་གྲུབ་པ།
en: Within it there is a great kūṭāgāra called Vairocana­vyūhālaṃkāra­garbha, which has been created by the ripening of a bodhisattva’s roots of merit.

source: བྱང་ཆུབ་སེམས་དཔའི་སེམས་དང་ཡིད་ལ་བྱ་བ་ལས་བྱུང་བ།
en: It has appeared from the mind and mentation of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་ལས་མངོན་པར་སྐྱེས་པ།
en: It has arisen from the prayers of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་དབང་ལས་བྱུང་བ།
en: It has appeared from the power of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་སྤྲུལ་བ།
en: It has been emanated by the power of the higher knowledge of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་ཐབས་མཁས་པ་ལས་བྱུང་བ།
en: It has appeared from the skillful methods of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་སྟོབས་ཀྱིས་རྫོགས་པ།
en: It has been perfected by the strength of the merit and knowledge of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོས་སེམས་ཅན་རྣམ་པར་གདུལ་བའི་དོན་དུ་བསྟན་པ།
en: It has manifested for the guiding of beings by the great compassion of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་བྱིན་གྱི་རླབས་རྣམ་པར་ཕྱེ་བས་བསྒྲུབས་པ།
en: It has been accomplished by the display of the blessing of a bodhisattva.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་གནས་ལ་འཇུག་པའི་རྒྱན་གྱིས་བརྒྱན་པ་ཡོད་དེ།
en: It is adorned by dwelling in the inconceivable state of bodhisattva liberation.

source: དེ་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ཞེས་བྱ་བ་སྐྱེ་བའི་ས་ལ་གནས་པའི་མྱི་རྣམས་རྗེས་སུ་གཟུང་བ་དང་། ཕ་དང་མ་དང་གཉེན་དུ་གྱུར་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། དེར་སྐྱེས་བའི་བྱང་ཆུབ་སེམས་དཔའ་སྐལ་བ་མཉམ་པ་རྣམས་ཀྱི་ཐེག་པ་ཆེན་པོ་རབ་ཏུ་བརྟན་པར་བྱ་བ་དང་། དེ་མ་ཡིན་པའི་སེམས་ཅན་གཞན་རྣམས་ཀྱང་གར་འོས་པའི་སར་དགེ་བའི་རྩ་བས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། རང་གི་རྣམ་པར་ཐར་པའི་ཚུལ་ལ་འཇུག་པར་བྱ་བ་ཡོངས་སུ་བསྟན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བ་ལ་དབང་བསྒྱུར་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་རབ་ཏུ་བརྗོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་ཡོངས་སུ་བསྟན་པ་ལ་མངོན་པར་གཞོལ་བར་བྱ་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་མི་གཏང་བ་དང་། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་གཟུང་བ་མི་སྨད་པས་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་བསྟན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་གནས་གཞི་རྟེན་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་གནས་མེད་པ་ལ་གཞོལ་བར་སྲིད་པར་སྐྱེ་བ་ཐམས་ཅད་ན་གནས་པ་ཡོངས་སུ་བསྟན་པའི་དོན་དུ་འདུག་གིས།
en: Within it resides the bodhisattva mahāsattva Maitreya, in order to take into his care the humans who dwell on the level of birth; in order to ripen fathers, mothers, and families; in order to make firm the Mahāyāna for bodhisattvas born there who have the corresponding conduct; in order to also ripen other beings with roots of merit according to their levels; in order to teach how to enter his own liberation; in order to describe how bodhisattvas with power over birth go everywhere intent on manifesting in the births of all beings in order not to forsake ripening beings; in order to generate the strength of the great compassion of a bodhisattva through not being inferior in caring for all beings; in order for bodhisattvas to realize rising up above all locations; and in order for them to manifest, without location, being located in all births in existences.

source: དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡོངས་སུ་དྲི་བ་དང་།
en: “Go to him and ask him, ‘How should a bodhisattva inquire about bodhisattva conduct?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ལམ་ཡོངས་སུ་དག་པར་བྱ་བ་དང་།
en: How should a bodhisattva purify the bodhisattva path?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་ནན་ཏན་དུ་བྱ་བ་དང་།
en: How should a bodhisattva practice the bodhisattva training?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་སྦྱང་བར་བྱ་བ་དང་།
en: How should a bodhisattva purify the aspiration to enlightenment?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པར་བྱ་བ་དང་།
en: How should a bodhisattva accomplish bodhisattva prayers?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཡོངས་སུ་བསགས་པར་བྱ་བ་དང་།
en: How should a bodhisattva gather the bodhisattva accumulations?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པར་བྱ་བ་དང་།
en: How should a bodhisattva ascend the bodhisattva bhūmis?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་དང་།
en: How should a bodhisattva complete the bodhisattva perfections?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ལ་འཇུག་པར་བྱ་བ་དང་།
en: How should a bodhisattva enter the patience of a bodhisattva?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ནན་ཏན་གྱི་ཡོན་ཏན་ལ་གནས་པར་བྱ་བ་དང་།
en: How should a bodhisattva dwell in the qualities of bodhisattva practice?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་བར་བྱ་བ་དྲིས་ཤིག །
en: How should a bodhisattva serve the kalyāṇamitras?’
